Repository: giellalt/corpus-fin
Catalog: tmx/sme/admin/sd/explanations_and_stories_fi/koulutusraportti_web_2_.pdf.tmx
Source language: fin
Languages: sme

source: Seuraavan kouluvuoden alkuun oli aikaa vain kaksi kuukautta, mistä huolimatta työryhmä päätti pyrkiä käynnistämään saamen kielen verkkoopetusta kotiseutualueen ulkopuolelle.
sme: Čuovvovaš skuvlajagi álgui leai áigi dušše guokte mánotbaji, mas fuolakeahttá bargojoavku mear ridii geahččalit álggahit sámegiela fierbmeoahpahusa ruovttuguovllu olggobealde.

source: Vanhempien verkostoa, sähköpostiyhteyksiä ja tiedotusvälineitä avuksi käyttäen se pyrki tavoittamaan saamen opetusta lapsilleen haluavia perheitä eri puolilta Suomea.
sme: Vánhemiid fierpmádaga, šleađgaboastaoktavuođaid ja dieđi han gaskaomiid geavahemiin dat geahččalii iešguđet guovllus Suomas juksat bearrašiid, geat háliidit sámegiela oahpahusa mánáidasa set.

source: Vanhemmille toimitettiin tiedote Saamelaiskäräjien ja Saamelaisalueen koulutuskeskuksen Saame virtuaa-likoulu hankkeen tavoitteesta saada aikaan kielen opetusta perusopetuksen ja lukion oppilaille.
sme: Vánhemiidda doaimmahuvvui dieđáhus Sámedikki ja Sámi oahpahusguovddáža Sámi virtuálaskuvla –prošeavtta ulbmilis oažžut áigái giela oahpahusa vuođđo skuvlla ja logahaga oahppiide.

source: Perimmäisenä tavoitteena oli saattaa virtuaaliopetus pysyvälle pohjalle ja jatkuvaksi toiminnaksi ja siten turvata oman kielen opetus myös kotiseutualueen ulkopuolella asuville.
sme: Loahpalaš ulbmilin leai ožžut virtuá laoahpahusa bissovaš vuođu ala ja bissovaš doaibman ja ná dorvvastit iežaset giela oahpahusa maid ruovttuguovllu olggobealde ássi sámiide.

source: Heti työn alussa kävi selväksi, että yhteistyöhön tarvittiin mukaan myös joku saamelaisalueen kunnista, koska koulutuskeskukselle annettu opetuksen järjestämislupa ei koskenut perusopetusta.
sme: Dalán barggu álggus čielggai, ahte oktasašbargui dárbbašuvvui mielde maid miinu sámeguovllu gielddain, daningo oahpahusguovddážii addon oahpahusa ordnenlohpi ii guoskan vuođđooahpahusa.

source: Opetusta organisoimassa oli siten kaksi toimijaa, saamelaiskäräjät ja saamelaisalueen koulutuskeskus, joilla molemmilla oli pyrkimys opetustilanteen edistämiseen, mutta kummallakaan ei ollut toimivaltaa eikä taloudellisia tai henkilöresursseja asiassa.
sme: Oahpa husa organiseremin ledje dakko guokte doaibmi, sámediggi ja sámi oah pahusguovddáš, main guktuin leai figgamuš oahpahusdili ovddi deapmái, muhto goappásge ii lean doaibmaváldi iige ekonomalaš dahje olmmoš resursa ášši hárrái.

source: Inarin kunta suhtautui myönteisti verkkoopetuksen järjestämiseen ja opetus saatiin kuitenkin käyntiin, vaikka kunnalla olisi ollut tarve käyttää omat opettajaresurssinsa kokonaan oman kunnan oppilaiden opetukseen.
sme: Anára gielda lei miehtemielalaš fierbmeoahpahusa ordnemii ja oahpahus álggahuvvui, váikko gielddas livččii lean dárbu geavahit iežas oahpaheairesurssaid oppalohkái iežas gieldda oahppiid oahpa hussii.

source: Kesän aikana ja vielä kouluvuoden alkaessakin työryhmä sai yhteydenottoja vanhemmilta ja opetusta saatiin järjestettyä Inarin kunnan opettajien kautta yhteensä 13 oppilaalle, joka oli noin puolet siitä oppilasmäärästä, jolle vanhemmat olivat pyytäneet opetusta.
sme: Geasi áigge ja velá skuvlajagi álggedettiinge bargojovkui bohte bivdagat vánhemiin. Oahpahus ordnašuvai Anára gieldda oahpahead djiid bokte oktiibuot 13 oahppái, mii leai sullii bealli dan oahppiid logus, masa vánhemat ledje bivdán oahpahusa.

source: Lisäksi on selvää, että työryhmän tiedotteet tavoittivat vain murtoosan kotiseutualueen ulkopuolella asuvista perheistä, joilla on perusopetus ja lukioikäisiä lapsia.
sme: Lassin lea čielggas, ahte bargojoavkku dieđáhusat jukse dušše unna oasi ruovttuguovllu olggobealde ássi bearrašiin, main leat vuođđooahpahus ja logahatahkásaš mánát.

source: Saamelaisalueen koulutuskeskuksen Saame virtuaalikoulu hankkeessa löydetty tekninen ratkaisu edesauttoi opetuksen järjestämistä, mutta edessä oli lukemattomia ongelmia: • opetuksen järjestämisessä oltiin liikkeellä liian myöhään ja pyynnöt ajan ja opetustilan järjestämiselle koulun saamen oppilaalle (joskus vain yhdelle / koulu) koettiin kouluissa hankalaksi;
sme: Sámi oahpahusguovddáža Sámi virtuálaskuvla prošeavttas gávdnon teknihkalaš čoavddus veahkehii oahpahusa ordnema, muhto ovddabealde ledje ollu váttisvuođat:• bargojoavku lei menddo maŋŋit jođus oahpahusa ordnemis ja bivdagat áiggi ja oahpahanlanja ordnemii skuvlla sámegiela oahppái (muhtumin dušše ovtta oahppái/ skuvla) vásihuvvui skuvllain váttisin;

source: • koulut eivät olleet halukkaita osallistumaan opetuksesta aiheutuneisiin kustannuksiin, joita olivat oppimateriaalit ja pienten teknisten apuvälineiden (headset) hankkiminen.
sme: • skuvllat eai lean dáhtolaččat váldit oasi oahpahusa goluide, mat šadde oahppamateriálain ja unna teknihkalaš veahkkeneavvuid (headset) skáhppomis.

source: Kouluissa katsottiin kustannusten kuuluvan opetusta järjestävälle koululle, eli Inarin kirkonkylän peruskoululle.
sme: Skuvllain gehččojuvvui, ahte golut gulle oahpahusa ordnejeaddjái, dán dilis Anára girkosiidda vuođđoskuvlii.

source: Suuremmista kustannuksista, kuten lisenssimaksuista, selvittiin Lapin verkkokouluhankkeen avulla, jonka lisenssejä voitiin käyttää tarkoitukseen.
sme: Stuorát golut šadde liseansamávssuin. Daidda veahkkin bođii Lappi fierbmeskuvlaprošeakta, man liseanssaid lei vejolaš geavahit ulbmilii

source: Saamelaisalueen koulutuskeskus, neuvotteli rahoituksesta viranomaisten kanssa useaan otteeseen.
sme: nuvttá. Sámi oahpahusguovddáš ráđđádalai ruhtadeamis eiseválddiiguin máŋgii.

source: Inarin kunta käytti kustannuksiin virtuaaliopetuksen kehittämiseen saamaansa valtionavustusta;
sme: Anára gielda geavahii goluide virtuálaoahpahusa ovddideapmái ožžon stáhtadoarjaga;

source: • myös virtuaaliopetuksen valvonnan järjestäminen ja lukujärjestysten yhteensovittaminen tuotti ongelmia sekä opetusta saavassa että sitä antavassa koulussa, erityisesti jos samassa verkkoopetuksen ryhmässä oli oppilaita useammasta koulusta;
sme: • maiddái virtuálaoahpahusa bearráigeahču ordnen ja lohkanortnega oktii heiveheapmi dagahii váttisvuođaid sihke oahpahusa oažžu ja dan addi skuvllas, erenoamážit juos seammá fierbmeoahpahusjoavkkus ledje oahppit máŋgga skuvllas;

source: • saamenkielistä verkkoopetuksen materiaalia ei juurikaan ollut ja opettaja valmisti sitä opetuksen edetessä tarpeiden mukaan.
sme: • sámegielat fierbmeoahpahusmateriála ii olus lean ja oahpaheaddji ráhkadii dan oahpahusa ovdánettiin dárbbuid mielde.

source: Vanhemmat ja oppilaat olivat tyytyväisiä alkaneeseen opetukseen, vaikka se tuotti ylimääräistä päänvaivaa myös heille eikä opetuksen jatkuvuudesta ollut tietoa.
sme: Vánhemat ja oahppit ledje duđavaččat álgán oahpahussii, váikko dat daga hii badjelmearálaš váttisvuođaid sidjiide iige oahpahusa joatkašuvva mis lean diehtu.

source: Työryhmä uusi tiedotuskierroksensa yhdessä valmiin ilmoittautumislomakkeen kanssa keväällä 2007. Kokeilun tulokset olivat samat ja opetusta järjestettiin samankokoiselle oppilasryhmälle kuin edellisenäkin vuonna.
sme: Bargojoavku sáddii ođđa dieđáhusa ovttas gárvves almmu han skoviin giđđat 2007. Geahččaleami bohtosat ledje seammát ja oahpa hus ordnejuvvui seammasturrosaš oahppiid jovkui go ovddit jagi.

source: Saame virtuaalikoulu hankkeen koordinaattori neuvotteli ja sopi opetuksen käytännön järjestelyistä eri puolilla Suomea sijaitsevien koulujen rehtoreiden kanssa ja piti yhteyksiä myös vanhempiin ja Inarin kuntaan.
sme: Sámi virtu álaskuvla prošeavtta koordináhtor ráđđádalai ja soabai oahpahu sa geavatlaš ordnemiin iešguđet guovllu skuvllaid rektoriiguin ja doa lai oktavuođaid maid vánhemiidda ja Anára gildii.

source: Verkkoopetusta antaneet opettajat saivat tarvittavan teknisen koulutuksen saamelaisalueen koulutuskeskuksesta.
sme: Fierbmeoahpahusa oahpaheaddjit ožžo dárbbašlaš teknihkalaš skuvlejumi sámi oahpa husguovddážis.

source: Opetusta annettiin Learnlinc Learnlinc on osoittautunut tarjolla olevista vaihtoehetäopetusjärjestelmässä siten, että opetus oli lähiopetuksen ja verkkoopetuksen välimuoto opettajan ollessa koko ajan mukana verkossa.
sme: Oahpahus addojuvvui Learnlinc Learnlinc lea vásigáiddusoahpahusvuogádagas nu, ahte oahpahus leai lagasoahpahusa ja fierbmeoahpahusa gaskasaš vuohki daningo oahpaheaddji leai olles áiggi mielde fierpmis.

source: doista parhaaksi toimivuutensa ja kohtuullisten laitevaatimustensa vuoksi.
sme: huvvon eará molssaeavttuid ektui buoremus čoavddusin daningo dat doaibmá bures ja das dárbbašuvvon rusttetgáibádusat leat govttolaččat.

source: Tavallisen verkkoyhteyden lisäksi tarvitaan headsetit (kuulokemikrofoni) ja pctietokone, myös webbikameran käyttö on ollut mahdollista.
sme: Dábálaš fierbmeoktavuođa lassin dárbbašuvvojit bealjusmikrofovnnat (headset) ja pcdihtor. Maiddái webkamera atnin lea leamaš vejolaš.

source: Yhden virtuaaliopetustunnin hinnaksi arvioitiin vajaat 40 euroa.
sme: Ovtta virtuálaoahpahusdiimmu haddin árvvoštallojuvvui vádjit 40 euro.

source: Virtuaaliopetuksessa tärkeänä osana olisi myös oppilaiden ja opettajan fyysinen tapaaminen, johon lukuvuosina 2006–2008 toteutetussa kokeilussa ei ollut varoja.
sme: Virtuálaoahpahusa oassin galggašii leahkit maid oahppiid ja oahpaheaddji fysalaš deaivvadeapmi, masa lohkanjagiid 2006–2008 ollašuhttojuvvon geahččaleamis eai lean resurssat.

source: Seuraavassa kokeilun aikana verkkoopetusta Inarin kunnasta saaneiden oppilaiden määrät ja paikkakunnat:
sme: Geahččaleami áigge fierbmeoahpahusa Anára gielddas ožžon oahppiid logut ja báikegottit: 2006–2007

source: Peruskoulut Kempele 2, Vääksy 1, Jyväskylä 3, Lohikoski 3, Iitti 1, Liperi 1 Lukiot Tampere 2, Vääksy 1, Pello 1, Liperi 1
sme: Vuođđoskuvllat: Kempele 2, Vääksy 1, Jyväskylä 3, Lohikoski 3, Iitti 1, Liperi 1 Logahagat: Tampere 2, Vääksy 1, Pello 1, Liperi 1

source: Peruskoulut Kempele 1,Vaasa 2, Liperi 1, Tuusula 1, Iitti 1 Lukiot Jyväskylä 1, Tampere 1, Rovaniemi 4Lisäksi Hollanti/ Rotterdam, 1 inarinsaamen perusopetuksen oppilas
sme: Vuođđoskuvllat: Kempele 1,Vaasa 2, Liperi 1, Tuusula 1, Iitti 1 Logahagat: Jyväskylä 1, Tampere 1, Roavvenjárga 4Lassin Hollánda/ Rotterdam, 1 anárašgiela vuođđooahpahusa oahppi

source: Saame virtuaalikoulu -hankkeesta
sme: Sámi virtuálaskuvla -prošeavttas

source: Saame virtuaalikoulu hanke oli käynnistetty erityisesti saamelaisnuorten, mutta myös aikuisopiskelijoiden tarpeita varten ja sen ensisijaisena toimintaalueena olivat saamelaisalueen koulut. Hankkeen pääasiallisena tavoitteena oli selvittää verkossa tapahtuvalle etäopetukselle sopivia teknisiä ratkaisuja ja välineitä ja luoda uudenlaisia, tasaarvoisia ja yksilöllisiä etä ja monimuotoopetukseen perustuvia joustavia koulutusjärjestelyjä saamen kielen ja saamenkieliseen opetukseen sekä kehittää opettajien ja koulujen käyttöön resurssipankki saamelaisista ja saamelaiskulttuurista.
sme: Sámi virtuálaskuvla prošeakta leai álggahuvvon erenoamážit sámenuoraid, muhto maid rávesoahppiid dárbbuid várás ja dan vuosttas doaibma guovlun ledje sámeguovllu skuvl lat. Prošeavtta váldoulbmilat ledje 1) čielggadit fierbmeoahpahussii/ gáiddusoahpahussii heivvolaš teknihkalaš čovdosiid ja gaskaomiid, 2) hábmet ođđalágan, dásseárvosaš ja njuovžilis vugiid ordnet sámegiela ja sámegielat oahpahusa, ja 3) ovddidit oahpaheaddjiid ja skuvllaid atnui resursabáŋkku sámiin ja sámekultuvrras.

source: Lisäksi tavoitteena on ollut kehittää opettajien verkkopedagogisia taitoja ja etäopetuksen opetussuunnitelmia.
sme: Lassin ulbmilin lea leamaš ovddidit oahpaheaddjiid fierbmepedagogalaš dáidduid ja gáiddusoahpahusa oahppoplánaid.

source: Hankkeella haluttiin edistää erityisesti saamelaisalueen opettajien verkostoitumista, yhteistyöskentelyä ja saamen kielen ja kulttuurin opettajaresurssien jakamista eri puolilla olevien oppilaiden ja opiskelijoiden tarpeisiin.
sme: Prošeavtta ulbmilin lei ovddidit erenoamážit sámeguovllu oahpaheaddjiid fierpmádaga, oktasašbarggu ja sámegiela ja kultuvrra oahpaheairesurssaid juohkima oahppiid ja stuđeanttaid dárbbuid várás, geat leat máŋgga sajis.

source: Hankkeessa saadun kokemuksen ja teknisten valmiuksien ollessa olemassa hankkeen koordinaattori oli kuitenkin valmis avustamaan verkko opetuksen liikkeelle saamista myös kotiseutualueen ulkopuolisessa perusopetuksessa ja lukiokoulutuksessa.
sme: Go prošeavttas ožžon hárjánupmi ja teknihkalaš válmmašvuođat ledje juo anus, prošeavtta koordináhtor leai goit gárvvis veahkehit fierbmeoahpahusa johtui fidnema maid ruovttuguovllu olggobeale vuođđooahpahusas ja logahatskuvlejumis.

source: Virtuaaliopetuksen kehittäminen jatkuu saamelaisalueen koulutuskeskuksessa uuden ESRhankkeen kautta, mutta koulutuskeskuksella ei ole mahdollisuutta kehittää saamen kielen opetus mahdollisuuksia perusopetuksen oppilaille.
sme: Virtuálaoahpahusa ovddideapmi joatkašuvvá ain (2009) Sámi oahpahusguovddážis ođđa ESRprošeavtta bokte, muhto oahpahusguovddážis ii leat vejolašvuohta ovddidit sámegiela oahpahusa vuođđooahpahusa oahppiide.

source: Koulutuskeskus on myös perustanut uuden virtuaaliopetuksen suunnittelijan viran.
sme: Oahpahusguovddáš lea maid vuođđudan ođđa virtuálaoahpahusa plánejeaddji virggi.

source: Verkkoopetuksen antaminen muutamalle lukion opiskelijalle kotiseutualueen ulkopuolelle jatkuu edelleen Inarin kunnan omana toimintana.
sme: Fierbmeoahpahusa addin muhtun logahaga oahppái ruovttuguovllu olggobeallai joatkašuvvá ain Anára gieldda iežas doaibman.

source: Saamelaisalueen koulutuskeskus on hakenut varoja valtakunnalliseen saamen kieleen ja kulttuuriin keskittyvään hankkeeseen, jonka kieliosiossa on mukana perusopetukseen liittyvän saamen kielen opetuksen järjestäminen.
sme: Sámi oahpahusguovddáš lea ohcan váriid riikkaviidosaš sámegiela ja kul tuvrra oahpahusprošektii, mas lea mielde maiddái sámegiela oahpahus vuođđoskuvllaide.

source: Hankkeessa valmistetun laskelman mukaan koulutuskeskus voisi vastata saamen kielen opetuksen järjestämisestä koko maan peruskouluissa noin 280.000 euron vuotuisella rahoituksella.
sme: Prošeaktaohcamušas válmmaštuvvon árvvoš talla ma mielde oahpahusguovddáš sáhtašii vástidit sámegiela oahpahusa 28 ordnemis oppa riikka vuođđoskuvllain sullii 280.000 euro jahkásaš ruhtademiin.

source: Rahoituksen puuttumisen lisäksi yhtenä esteenä on se, että tällä hetkellä koulutuskeskuksesta annettu laki ei mahdollista perusopetuksen antamista.
sme: Ruhtadeami váiluma lassin oktan hehttehussan lea dat, ahte oahpahusguovddáža birra addon láhka ii vuos daga vejolažžan vuođđooahpahusa addima.

source: Lakia ollaan parhaillaan uudistamassa, mutta tämän asian mukanaolosta uudistuksessa ei ole varmuutta.
sme: Lága leat bárrásiin ođasmahttimin, muhto ahte dát ášši lea ođastusas fárus ii leat sihkkar.

source: 7. Saamelaiskäräjien kannanottoja
sme: 7. Sámedikki bealiváldimat

source: Saamelaiskäräjien antamissa lausunnoissa ja sen tekemissä esityksissä opetusministeriölle ja eduskunnan valiokunnille on käsitelty saamelaisopetusta kokonaisuutena, jossa ovat mukana sekä kotiseutualue että sen ulkopuolella sijaitsevat paikkakunnat.
sme: Sámedikki cealkámušain ja evttohusain oahpahusministeriijai ja riikkabeivviid lávdegottiide sámeoahpahus lea gieđahallojuvvon ollisvuohtan, mas leat mielde sihke ruovttuguovllu gielddat ja báikegottit, mat leat daid olggobealde.

source: Vuodesta 2004 lähtien lausunnoissa on kiinnitetty vakavaa huomiota siihen, että perusopetuikäisistä saamelaisoppilaista jää nykysäännösten seurauksena saamelaisopetuksen ulkopuolelle vähintään 50%.
sme: Jagi 2004 rájes cealkámušain lea giddejuvvon duođalaš fuomášupmi dasa, ahte dálá njuolggadusaid čuovvumuššan sáme oahpahusa olggobeallai báhcá unnimustá 50 % vuođđooahpahusahkásaš sámeoahppiin.

source: Toisella asteella osuuden on arvioitu olevan vielä suuremman.
sme: Nuppi dásis (logahat ja ámmátskuvlejumis) dát oassi lea árvvoštallojuvvon velá stuorábun.

source: Saamelaiskäräjät on pitänyt tilannetta perustuslain ja Suomen antamien kansainvälisten sitoumusten ja alkuperäiskansan oikeuksien vastaisena ja nähnyt sen johtavan nopeasti saamelaisväestön yksikielistymiseen ja yhteyksien katkeamiseen saamelaisyhteisöön.
sme: Sámedikki mielas dilli lea Suoma vuođđolága ja Suoma addin riikkaidgaskasaš čatnasumiid ja eamiálbmogiid vuoigatvuođaid vuostá. Sámediggi lea váruhan, ahte dákkár dilli boahtá jođánit doalvut sámeálbmoga ovttagielalašvuhtii ja oktavuođaid boatkaneapmái sámeservodahkii.

source: Lausunnoissa todetaan viranomaisten välinpitämättömyyden tarkoittavan saamelaisten sulauttamista valtaväestöön oppivelvollisuuskoulun kautta.
sme: Cealkámušain gávnnahuvvo, ahte eiseválddiid berošmeahttunvuohta oaiv vilda sámiid suddadeami váldoálbmogii oahppo geatnegas vuohtaskuvl la bokte.

source: Saamelaiskäräjät on pyytänyt opetusministeriötä asettamaan saamelaisopetuksen kokonaisuutta, sitä koskevia toiminnallisia ja rahoitussäännöksiä, opettaja ja oppimateriaalitilannetta, opetussuunnitelmaa, opetuksen saatavuutta ja hallintoa selvittävän työryhmän ja saamelaisopetuksen suunnitelmallisen kehittämisen käynnistämistä.
sme: Sámediggi lea bivdán oahpahusministeriija ásahit bargojoavkku, man bargun livččii čielggadit sámeoahpahusa ollisvuođa, dan guoski doaibma ja ruhtadannjuolggadusaid, oahpaheaddji ja oahppamateriáladiliid, oahppa plánaid, oahpahusa oažžuma ja hálddahusa. Bargojoavku galggašii bidjat johtui sámeoahpahusa diđolaš, oppalaš ja plánejuvvon ovddidanbarggu.

source: Lisäksi on pyydetty saamelaisopetuksen käsittelemistä erillään muiden vähemmistöjen, mm. maahanmuuttajien omissa kielissä annetusta opetuksesta ja luomaan saamelaiskäräjien ja opetusministeriön välille säännöllinen saamelaisopetusta koskeva neuvottelu ja raportointikäytäntö ja parantamaan saamelaiskäräjien mahdollisuuksia saamelaisopetuksen kehittämiseen ja koulutuksen järjestäjien ja saamelaisten vanhempien avustamiseen.
sme: Lassin leat bivdán sámeoahpahusa gieđahallama sierra eará vehádagaid, ee. sisafárrejeaddjiid iežaset gielain addon oahpahusas ja vuođđudit sáme dikki ja oahpahusministeriija gaskii jeavddalaš sámeoahpahusa guoski ráđđádallan ja raporterengeavadaga. Sámedikki vejolašvuođaid sámeoahpahusa ovddideapmái ja skuvlejumi ordnejeaddjiid ja sápmelaš vánhemiid doarjumii galggašii buoridit.

source: Opetusministeriö ei ole toistaiseksi asettanut työryhmää eikä puuttunut vaikeuksiin.
sme: Oahpahusministeriija ii leat doisttážii ásahan bargojoavkku iige váldán beali váttisvuođaide.

source: Helmikuussa 2006 opetusministeriölle tehdyssä Paras hankkeeseen liittyvässä esityksessä todetaan mm. seuraavasti:
sme: Guovvamánus 2006 oahpahusministeriijai dahkkon Paras prošektii laktáseaddji evttohusas gávnnahuvvo ee. ná:

source: ”Saamelaisopetukseen liittyy merkittäviä ongelmia ja puutteita, joiden ratkaisemiselle voidaan luoda edellytyksiä kunta ja palvelurakenneuudistuksen yhteydessä toteutettavin uudistuksin:1. saamenkielinen opetus kärsii opettaja- ja oppimateriaalipulasta ja saamenkielisen opetuksen osuus vähenee selvästi oppilaan siirtyessä perusopetuksen ylemmille luokille – suurimmat puutteet koskevat inarin ja koltansaamen kielten ja kielistä opetusta;
sme: ”Sámeoahpahussii laktásit mearkkašahtti váttisvuođat ja váilevašvuođat, maid čoavdimii lea vejolaš láhčit eavttuid gielda ja bálvalan ortnega ođasmahttima oktavuođas:

source: 2. kunnilla on vaikeuksia opetuslainsäädännön edellyttämän saamenkielisen opetuksen erityisen opetussuunnitelman valmistamisessa, koska tehtävä on uusi ja työltä puuttuvat yleiset ohjeet;
sme: 2. gielddain leat váttisvuođat oahpahusláhkaásaheami gáibidan sámegielat oahpahusa sierra oahppaplána ráhkadeamis, daningo bargu lea ođas ja das váilot oktasaš rávvagat;

source: 3. yhtenäisen saamelaisopetuksen opetussuunnitelman puuttuminen tarkoittaa sitä, että opetussuunnitelman perusteissa saamelaisten opetukselle asetetut yleiset tavoitteet otetaan huomioon satunnaisesti;
sme: 3. sámeoahpahusa oktilas oahppaplána váilun oaivvilda dan, ahte oahppaplána vuođustusain sámiid oahpahussii ásahuvvon oktasaš ulbmilat váldojit vuhtii deivvolaččat;

source: 4. opetuksen tuloksellisuudesta, tilasta, saavutettavuudesta, opetussuunnitelman perusteissa asetettujen tavoitteiden toteutumisesta (mm. kaksikielisyys ja oman kulttuurin huomioiminen) ja saamelaisoppilaiden opetuksellisten oikeuksien toteutumisesta suomalaisessa koulussa puuttuu arvioinnin kautta saatua tietoa, jonka pohjalta opetusta voitaisiin vastaisuudessa kehittää.
sme: 4. oahpahusa bohtosiin, diliin, ulbmiliid juksamis, oahppaplána vuođustusain ásahuvvon ulbmiliid ollašuvvamis (ee. guovttegielatvuohta ja sámi kultuvrra vuhtii váldin) ja sámeoahppiid oahpahuslaš vuoigatvuođaid ollašuvvamis suopmelaš skuvllas váilu árvvoštallama bokte fidnejun diehtu, man vuođul oahpa husa sáhtašii boahtteáiggis ovddidit.

source: Koulutuksen arviointi on ollut lakisääteistä vuodesta 1999 lähtien, mistä huolimatta saamelaisopetusta ei ole huomioitu kansallisissa arviointiohjelmissa;
sme: Skuvlema árvvoštallan lea vuođđuduvvan láhkii jagi 1999 rájes, mas fuolakeahttá sámeoahpahus ii leat mielde nášuvnnalaš árvvoštallanprográmmain;

source: 5. voimassaoleva rahoitus turvaa opetuksen järjestämisen vain saamelaisten kotiseutualueella, jonka seurauksena yli puolet perusopetus-ikäisistä saamelaislapsista ja nuorista jää kokonaan oman kielen ja omakielisen opetuksen ulkopuolelle, eikä tässä opetuksessa ole mahdollista noudattaa opetussuunnitelman perusteissa määriteltyjä opetuksen sisältöjä, tavoitteita eikä tuntijakosäännöksiä.
sme: 5. ruhtadeapmi, mii lea fámus, dorvvasta oahpahusa ordnema dušše sámiid ruovttuguovllus, mas boahtá ahte badjel bealli vuođđo-oahpa hus ahkásaš sámemánáin ja -nuorain báhcet ollásit eatni-giela ja eatnigielat oahpahusa olggobeallai, iige dán oahpahusas leat vejolaš čuovvut oahppaplána vuođustusain meroštallojuvvon oahpahusa sisdoaluid, ulbmiliid iige diibmojuohkonjuolggadusaid.

source: Saamelaisopetuksen turvaaminen edellyttää kokonaisvaltaista kehittämistä ja sen varmistamista, ettei koulu enää jatka saamelaisten sulauttamista eikä edistä kielenvaihdosta, johon nykyinen tilanne vääjäämättä johtaa.
sme: Sámeoahpahusa dorvvasteapmi gáibida ollislaš ovddideami ja dan sihkkarastima, ahte skuvla ii šat joatkke sámiid suddadeami iige ovddit giellamolsuma, masa dálá dilli vealtameahttumit doalvu.

source: Saamelaiskäräjien vaikutus ja päätösvaltaa tulee lisätä merkittävästi ja kehittää sen koulutus ja oppimateriaalitoimistosta opetuksen kehittämisestä vastaava keskus.
sme: Sámedikki váikkuhan ja mearridanválddi galgá lasihit čielgasit ja hábmet dan skuvlen ja oahppamateriáladoaimmahagas oahpahusa ovddideamis vástideaddji guovddáža.

source: Saamelaisopetus muo dostaa suomalaisen koulun sisällä häviävän pienen osan, jonka kehittämistä ei saa jättää sattumanvaraisesti ja hajanaisesti hoidetuksi.”
sme: Sámeoahpahus lea suopmelaš skuvlla siste hui unna oassi, man ovddideami ii oaččo guođđit nu ahte dat dikšojuvvo deivvolaččat ja biđgosit.”

source: Lokakuussa 2007 annetussa opetusministeriön yhdenvertaisuussuunnitelmaa koskevassa lausunnossa todetaan mm. seuraavasti:
sme: Golggotmánus 2007 addojuvvon oahpahusministeriija ovtta veardásašvuođaplána guoski čealkámušas gávnnahuvvo ee. ná:

source: ”Saamelaiskäräjät haluaa kiinnittää huomiota saamelaisten asemaan Suomen ainoana alkuperäiskansana, joka edellyttää mm. ministeriöiltä saamelaisille kansana kuuluvien yhteisöllisten, ei ainoastaan yksilöitä koskevien oikeuksien, huomioon ottamista niiden säädöstenvalmistelu, valtionavustus, strategia ja suunnittelutyössä.
sme: ”Sámediggi háliida giddet fuomášumi sámiid dillái Suoma áidna eamiálbmogin, mii gáibida ee. ministeriijain sámiide álbmogin gulli servvodatlaš, ii dušše persovnnaid guoski vuoigatvuođaid, vuhtii váldima daid ásahusaid válmmaštallan, stáhtadoarjja, strategiija ja plánenbarggus.
